/*****************************************************************************/
/*!
 *  \file        mrv_priv.h \n
 *  \version     1.2 \n
 *  \author      Friebe \n
 *  \brief       Private header of Marvin driver. \n
 *
 *  \note        Some defines are currently not used in the code, \n
 *               so they are added as comment only. \n
 *
 *  \revision    $Revision: 432 $ \n
 *               $Author: neugebaa $ \n
 *               $Date: 2009-06-30 11:48:59 +0200 (Di, 30 Jun 2009) $ \n
 *               $Id: mrv_priv.h 432 2009-06-30 09:48:59Z neugebaa $ \n
 */
/*  This is an unpublished work, the copyright in which vests in Silicon Image
 *  GmbH. The information contained herein is the property of Silicon Image GmbH
 *  and is supplied without liability for errors or omissions. No part may be
 *  reproduced or used expect as authorized by contract or other written
 *  permission. Copyright(c) Silicon Image GmbH, 2009, all rights reserved.
 */
/*****************************************************************************/

#ifndef _MRV_PRIV_H
#define _MRV_PRIV_H

// for doxygen :(
#include "stdinc.h"


/********************************************************************/
//Marvin Registers
/********************************************************************/

// Defintions of block register sizes
#define MRV_ISP_GAMMA_R_Y_ARR_SIZE 17
#define MRV_ISP_GAMMA_G_Y_ARR_SIZE 17
#define MRV_ISP_GAMMA_B_Y_ARR_SIZE 17
#define MRV_ISP_CT_COEFF_ARR_SIZE 9
#define MRV_ISP_GAMMA_OUT_Y_ARR_SIZE 17
#define MRV_ISP_BP_NEW_TABLE_ARR_SIZE 8
#define MRV_ISP_HIST_BIN_ARR_SIZE 16

// - REGISTER LAYOUT ----------------------------------------------------------
typedef struct
{
    UINT32 vi_ccl; // Clock control register (rw) MRV_BASE + 0x0000
    UINT32 vi_custom_reg1;                      // 0x04 reserved
    UINT32 vi_id; // Revision identification register (r) MRV_BASE + 0x0008
    UINT32 vi_custom_reg2;                      // 0x0C reserved
    UINT32 vi_iccl; // Internal clock  control register (rw) MRV_BASE + 0x0010
    UINT32 vi_ircl; // Internal reset control register (rw) MRV_BASE + 0x0014
    UINT32 vi_dpcl; // Data path control register (rw) MRV_BASE + 0x0018

#if (MARVIN_FEATURE_CLOCK_DOMAINS == MARVIN_CLOCK_DOMAINS_2)
    UINT32 vi_toc;                              // 0x1C access timeout control register
#elif (MARVIN_FEATURE_CLOCK_DOMAINS == MARVIN_CLOCK_DOMAINS_1)
    UINT32 notused_mrvbase1;
#else   // MARVIN_FEATURE_CLOCK_DOMAINS
    #error unknown MARVIN_FEATURE_CLOCK_DOMAINS
#endif  // MARVIN_FEATURE_CLOCK_DOMAINS

#if ((MARVIN_FEATURE_DMA_READ == MARVIN_FEATURE_DMA_READ_V1) || \
     (MARVIN_FEATURE_DMA_READ == MARVIN_FEATURE_DMA_READ_V2))
    UINT32 vi_spmcl;                            // 0x20 self path mux control register
    UINT32 notused_mrvbase2[(0x200-0x24)/4];    // memory gap with selfpicture DMA
#else   // MARVIN_FEATURE_DMA_READ
    UINT32 notused_mrvbase2[(0x200-0x20)/4];    // memory gap without selfpicture DMA
#endif  // MARVIN_FEATURE_DMA_READ

#if (MARVIN_FEATURE_IMAGE_EFFECTS >= MARVIN_FEATURE_EXIST)
//    UINT32 ie_ctrl;                             // 0x200
//    UINT32 ie_color_sel;                        // 0x204
//    UINT32 ie_mat_1;                            // 0x208
//    UINT32 ie_mat_2;                            // 0x20C
//    UINT32 ie_mat_3;                            // 0x210
//    UINT32 ie_mat_4;                            // 0x214
//    UINT32 ie_mat_5;                            // 0x218
//    UINT32 ie_tint;                             // 0x21C
//    UINT32 ie_ctrl_shd;                         // 0x220
    UINT32 img_eff_ctrl; // Global control register (rw) MRV_IMGEFF_BASE + 0x0000
    UINT32 img_eff_color_sel; // Color selection register (for color selection effect) (rw) MRV_IMGEFF_BASE + 0x0004
    UINT32 img_eff_mat_1; // 3x3 matrix coefficients for emboss effect (1) (rw) MRV_IMGEFF_BASE + 0x0008
    UINT32 img_eff_mat_2; // 3x3 matrix coefficients for emboss effect (2) (rw) MRV_IMGEFF_BASE + 0x000c
    UINT32 img_eff_mat_3; // 3x3 matrix coefficients for emboss(3) effect / sketch(1) effect (rw) MRV_IMGEFF_BASE + 0x0010
    UINT32 img_eff_mat_4; // 3x3 matrix coefficients for sketch effect (2) (rw) MRV_IMGEFF_BASE + 0x0014
    UINT32 img_eff_mat_5; // 3x3 matrix coefficients for sketch effect (3) (rw) MRV_IMGEFF_BASE + 0x0018
    UINT32 img_eff_tint; // Chrominance increment values of a tint (used for sepia effect) (rw) MRV_IMGEFF_BASE + 0x001c
    UINT32 img_eff_ctrl_shd; // Shadow register for control register (r) MRV_IMGEFF_BASE + 0x0020
#if (MARVIN_FEATURE_IMAGE_EFFECTS >= MARVIN_FEATURE_IE_V3)
    UINT32 img_eff_sharpen; // Factor and threshold for sharpen effect (rw) MRV_IMGEFF_BASE + 0x0024
    UINT32 notused_imgeff[(0x300-0x228)/4];     // memory gap with image effects
#else // (MARVIN_FEATURE_IMAGE_EFFECTS >= MARVIN_FEATURE_IE_V3)
    UINT32 notused_imgeff[(0x300-0x224)/4];     // memory gap with image effects
#endif
#else   // MARVIN_FEATURE_IMAGE_EFFECTS
    UINT32 notused_imgeff[(0x300-0x200)/4];     // memory gap without image effects
#endif  // MARVIN_FEATURE_IMAGE_EFFECTS

#if (MARVIN_FEATURE_SUPERIMPOSE == MARVIN_FEATURE_EXIST)
//    UINT32 si_ctrl;                             // 0x300
//    UINT32 si_offset_x;                         // 0x304
//    UINT32 si_offset_y;                         // 0x308
//    UINT32 si_color_y;                          // 0x30C
//    UINT32 si_color_cb;                         // 0x310
//    UINT32 si_color_cr;                         // 0x314
    UINT32 super_imp_ctrl; // Global control register (rw) MRV_SI_BASE + 0x0000
    UINT32 super_imp_offset_x; // Offset x register (rw) MRV_SI_BASE + 0x0004
    UINT32 super_imp_offset_y; // Offset y register (rw) MRV_SI_BASE + 0x0008
    UINT32 super_imp_color_y; // Y component of transparent key color (rw) MRV_SI_BASE + 0x000c
    UINT32 super_imp_color_cb; // Cb component of transparent key color (rw) MRV_SI_BASE + 0x0010
    UINT32 super_imp_color_cr; // Cr component of transparent key color (rw) MRV_SI_BASE + 0x0014
    UINT32 notused_simp[(0x400-0x318)/4];       // memory gap with superimpose
#else   // MARVIN_FEATURE_SUPERIMPOSE
    UINT32 notused_simp[(0x400-0x300)/4];       // memory gap without superimpose
#endif  // MARVIN_FEATURE_SUPERIMPOSE

    UINT32 isp_ctrl; // global control register (rw – partly write-only) MRV_ISP_BASE + 0x0000
    UINT32 isp_acq_prop; // ISP acquisition properties (rw) MRV_ISP_BASE + 0x0004
    UINT32 isp_acq_h_offs; // horizontal input offset (rw) MRV_ISP_BASE + 0x0008
    UINT32 isp_acq_v_offs; // vertical input offset (rw) MRV_ISP_BASE + 0x000c
    UINT32 isp_acq_h_size; // horizontal input size (rw) MRV_ISP_BASE + 0x0010
    UINT32 isp_acq_v_size; // vertical input size (rw) MRV_ISP_BASE + 0x0014
    UINT32 isp_acq_nr_frames; // Number of frames to be captured (rw) MRV_ISP_BASE + 0x0018
//    UINT32 isp_gamma_dx0;                       // 0x41C input gamma curve dx1...dx8 increments
//    UINT32 isp_gamma_dx1;                       // 0x420 input gamma curve dx9...dx16 increments
//    UINT32 isp_gamma_r_y0;                      // 0x424 input gamma curve y0 value (R)
//    UINT32 isp_gamma_r_y1;                      // 0x428 input gamma curve y1 value (R)
// ...
//    UINT32 isp_gamma_r_y16;                     // 0x464 input gamma curve y16 value (R)
//    UINT32 isp_gamma_g_y0;                      // 0x468 input gamma curve y0 value (G)
//    UINT32 isp_gamma_g_y1;                      // 0x46C input gamma curve y1 value (G)
// ...
//    UINT32 isp_gamma_g_y16;                     // 0x4A8 input gamma curve y16 value (G)
//    UINT32 isp_gamma_b_y0;                      // 0x4AC input gamma curve y0 value (B)
//    UINT32 isp_gamma_b_y1;                      // 0x4B0 input gamma curve y1 value (B)
// ...
//    UINT32 isp_gamma_b_y16;                     // 0x4EC input gamma curve y16 value (B)
    UINT32 isp_gamma_dx_lo; // De-Gamma Curve definition lower x increments (sampling points) (rw) MRV_ISP_BASE + 0x001c
    UINT32 isp_gamma_dx_hi; // De-Gamma Curve definition higher x increments (sampling points) (rw) MRV_ISP_BASE + 0x0020
    UINT32 isp_gamma_r_y[MRV_ISP_GAMMA_R_Y_ARR_SIZE]; // De-Gamma Curve definition y red (rw) 0x0024+n (n=0..16)
    UINT32 isp_gamma_g_y[MRV_ISP_GAMMA_G_Y_ARR_SIZE]; // De-Gamma Curve definition y green (rw) 0x0068+n (n=0..16)
    UINT32 isp_gamma_b_y[MRV_ISP_GAMMA_B_Y_ARR_SIZE]; // De-Gamma Curve definition y blue (rw) 0x00AC+n (n=0..16)

#if ((MARVIN_FEATURE_BLACK_LEVEL >= MARVIN_FEATURE_BLACK_LEVEL_V1) && \
     (MARVIN_FEATURE_BLACK_LEVEL <= MARVIN_FEATURE_BLACK_LEVEL_V3))
    UINT32 isp_bls_prop;                        // 0x4F0 black level subtraction properties
    UINT32 isp_bls_h_window;                    // 0x4F4 black level horizontal window definition
    UINT32 isp_bls_v_window;                    // 0x4F8 black level vertical window definition
    UINT32 isp_bls_samples;                     // 0x4FC number of samples for black level subtraction
    UINT32 isp_bls_ref_value_ab;                // 0x500 black level value A and B for manual control
    UINT32 isp_bls_ref_value_cd;                // 0x504 black level value C and D for manual control
    UINT32 isp_bls_mean_value_ab;               // 0x508 measured black level value for A and B
    UINT32 isp_bls_mean_value_cd;               // 0x50C measured black level value for C and D
#else   // MARVIN_FEATURE_BLACK_LEVEL
    UINT32 notused_ispbls1[(0x510-0x4F0)/4];    // memory gap (without BLS version 1 - 3)
#endif  // MARVIN_FEATURE_BLACK_LEVEL

    UINT32 isp_awb_prop;   // Auto white balance properties (rw) MRV_ISP_BASE + 0x0110
    UINT32 isp_awb_h_offs; // Auto white balance horizontal offset of measure window (rw) MRV_ISP_BASE + 0x0114
    UINT32 isp_awb_v_offs; // Auto white balance vertical offset of measure window (rw) MRV_ISP_BASE + 0x0118
    UINT32 isp_awb_h_size; // Auto white balance horizontal window size (rw) MRV_ISP_BASE + 0x011c
    UINT32 isp_awb_v_size; // Auto white balance vertical window size (rw) MRV_ISP_BASE + 0x0120
    UINT32 isp_awb_frames; // Auto white balance mean value over multiple frames (rw) MRV_ISP_BASE + 0x0124
    UINT32 isp_awb_ref;    // Auto white balance reference Cb/Cr values (rw) MRV_ISP_BASE + 0x0128
    UINT32 isp_awb_thresh; // Auto white balance threshold values (rw) MRV_ISP_BASE + 0x012c

    UINT32 notused_ispawb2[(0x538-0x530)/4];    // memory gap (without hardware automatic measurement)

    UINT32 isp_awb_gain_g; // Auto white balance gain green (rw) MRV_ISP_BASE + 0x0138
    UINT32 isp_awb_gain_rb; // Auto white balance gain red and blue (rw) MRV_ISP_BASE + 0x013c

    UINT32 isp_awb_white_cnt; // Auto white balance white pixel count (r) MRV_ISP_BASE + 0x0140
    UINT32 isp_awb_mean; // Auto white balance measured mean value (r) MRV_ISP_BASE + 0x0144

#if (MARVIN_FEATURE_AUTO_EXPOSURE == MARVIN_FEATURE_AUTO_EXPOSURE_V1)
    UINT32 isp_ae_h_offs;                       // 0x548 auto exposure measurement window horizontal offset
    UINT32 isp_ae_v_offs;                       // 0x54C auto exposure measurement window vertical offset
    UINT32 isp_ae_h_size;                       // 0x550 auto exposure measurement window horizontal size
    UINT32 isp_ae_v_size;                       // 0x554 auto exposure measurement window vertical size
    UINT32 isp_ae_frames;                       // 0x558 number of frames for mean value calculation
    UINT32 isp_ae_hist_range;                   // 0x55C auto exposure luminance histogram range
    UINT32 isp_ae_occ_y;                        // 0x560 auto exposure luminance histogram occurrence
    UINT32 isp_ae_mean_y;                       // 0x564 auto exposure mean luminance value
    UINT32 isp_ae_max_y;                        // 0x568 auto exposure maximum luminance value
    UINT32 isp_ae_min_y;                        // 0x56C auto exposure minimum luminance value
#else   // MARVIN_FEATURE_AUTO_EXPOSURE
    UINT32 notused_ispae[(0x570-0x548)/4];      // memory gap (without exposure measurement V1)
#endif  // MARVIN_FEATURE_AUTO_EXPOSURE

    UINT32 isp_cc_coeff_0; // Color conversion coefficient 0 (rw) MRV_ISP_BASE + 0x0170
    UINT32 isp_cc_coeff_1; // Color conversion coefficient 1 (rw) MRV_ISP_BASE + 0x0174
    UINT32 isp_cc_coeff_2; // Color conversion coefficient 2 (rw) MRV_ISP_BASE + 0x0178
    UINT32 isp_cc_coeff_3; // Color conversion coefficient 3 (rw) MRV_ISP_BASE + 0x017c
    UINT32 isp_cc_coeff_4; // Color conversion coefficient 4 (rw) MRV_ISP_BASE + 0x0180
    UINT32 isp_cc_coeff_5; // Color conversion coefficient 5 (rw) MRV_ISP_BASE + 0x0184
    UINT32 isp_cc_coeff_6; // Color conversion coefficient 6 (rw) MRV_ISP_BASE + 0x0188
    UINT32 isp_cc_coeff_7; // Color conversion coefficient 7 (rw) MRV_ISP_BASE + 0x018c
    UINT32 isp_cc_coeff_8; // Color conversion coefficient 8 (rw) MRV_ISP_BASE + 0x0190

#if ((MARVIN_FEATURE_OUTPUT_FORMATTER >= MARVIN_FEATURE_OUTPUT_FORMATTER_V1) && \
     (MARVIN_FEATURE_OUTPUT_FORMATTER <= MARVIN_FEATURE_OUTPUT_FORMATTER_V2))
    UINT32 isp_out_h_offs; // Horizontal offset of output window (rw) MRV_ISP_BASE + 0x0194
    UINT32 isp_out_v_offs; // Vertical offset of output window (rw) MRV_ISP_BASE + 0x0198
    UINT32 isp_out_h_size; // Output horizontal picture size (rw) MRV_ISP_BASE + 0x019c
    UINT32 isp_out_v_size; // Output vertical picture size (rw) MRV_ISP_BASE + 0x01a0
#else   // MARVIN_FEATURE_OUTPUT_FORMATTER
    UINT32 notused_ispout1[(0x5A4-0x594)/4];    // memory gap (without output formatter)
#endif  // MARVIN_FEATURE_OUTPUT_FORMATTER

    UINT32 isp_demosaic; // Demosaic parameters (rw) MRV_ISP_BASE + 0x01a4
    UINT32 isp_flags_shd; // Shadow flags (current status of certain signals) (r) MRV_ISP_BASE + 0x01a8

#if ((MARVIN_FEATURE_OUTPUT_FORMATTER >= MARVIN_FEATURE_OUTPUT_FORMATTER_V1) && \
     (MARVIN_FEATURE_OUTPUT_FORMATTER <= MARVIN_FEATURE_OUTPUT_FORMATTER_V2))
    UINT32 isp_out_h_offs_shd; // current horizontal offset of output window (shadow register) (r) MRV_ISP_BASE + 0x01ac
    UINT32 isp_out_v_offs_shd; // current vertical offset of output window (shadow register) (r) MRV_ISP_BASE + 0x01b0
    UINT32 isp_out_h_size_shd; // current output horizontal picture size (shadow register) (r) MRV_ISP_BASE + 0x01b4
    UINT32 isp_out_v_size_shd; // current output vertical picture size (shadow register) (r) MRV_ISP_BASE + 0x01b8
#else   // MARVIN_FEATURE_OUTPUT_FORMATTER
    UINT32 notused_ispout2[(0x5BC-0x5AC)/4];    // memory gap (without output formatter)
#endif  // MARVIN_FEATURE_OUTPUT_FORMATTER

    UINT32 isp_imsc; // Interrupt mask (rw) MRV_ISP_BASE + 0x01bc
    UINT32 isp_ris; // Raw interrupt status (r) MRV_ISP_BASE + 0x01c0
    UINT32 isp_mis; // Masked interrupt status (r) MRV_ISP_BASE + 0x01c4
    UINT32 isp_icr; // Interrupt clear register (w) MRV_ISP_BASE + 0x01c8
    UINT32 isp_isr; // Interrupt set register (w) MRV_ISP_BASE + 0x01cc

#if ((MARVIN_FEATURE_XTALK >= MARVIN_FEATURE_XTALK_10BITS) && \
     (MARVIN_FEATURE_XTALK <= MARVIN_FEATURE_XTALK_11BITS))
//    UINT32 isp_ct_coeff_0;                      // 0x5D0 crosstalk matrix coefficient 0
//    UINT32 isp_ct_coeff_1;                      // 0x5D4 crosstalk matrix coefficient 1
// ...
//    UINT32 isp_ct_coeff_8;                      // 0x5F0 crosstalk matrix coefficient 8
    UINT32 isp_ct_coeff[MRV_ISP_CT_COEFF_ARR_SIZE]; // cross-talk configuration register (color correction matrix) (rw) 0x01D0+n (n=0..8)
#else   // MARVIN_FEATURE_XTALK
    UINT32 notused_ispxtalk[(0x5F4-0x5D0)/4];   // memory gap (without CrossTalk)
#endif  // MARVIN_FEATURE_XTALK

#if (MARVIN_FEATURE_GAMMAOUT == MARVIN_FEATURE_EXIST)
//    UINT32 isp_gamma_out_y0;                    // 0x5F8 output gamma curve y0 value
//    UINT32 isp_gamma_out_y1;                    // 0x5FC output gamma curve y1 value
// ...
//    UINT32 isp_gamma_out_y16;                   // 0x638 output gamma curve y16 value
    UINT32 isp_gamma_out_mode; // gamma segmentation mode register for output gamma (rw) MRV_ISP_BASE + 0x01f4
    UINT32 isp_gamma_out_y[MRV_ISP_GAMMA_OUT_Y_ARR_SIZE]; // Gamma Out Curve definition y (rw) 0x01F8+n (n=0..16)
#else   // MARVIN_FEATURE_GAMMAOUT
    UINT32 notused_ispgammaout[(0x63C-0x5F4)/4];// memory gap (without gamma out)
#endif  // MARVIN_FEATURE_GAMMAOUT

#if (MARVIN_FEATURE_ISP_ERRORFLAGS == MARVIN_FEATURE_EXIST)
    UINT32 isp_err; // ISP error register (r) MRV_ISP_BASE + 0x023c
    UINT32 isp_err_clr; // ISP error clear register (w) MRV_ISP_BASE + 0x0240
#else   // MARVIN_FEATURE_ISP_ERRORFLAGS
    UINT32 notused_isperr[(0x644-0x63C)/4];     // memory gap (without error flags)
#endif  // MARVIN_FEATURE_ISP_ERRORFLAGS

#if (MARVIN_FEATURE_FRAMECOUNTER == MARVIN_FEATURE_EXIST)
    UINT32 isp_frame_count; // Frame counter (r) MRV_ISP_BASE + 0x0244
#else   // MARVIN_FEATURE_FRAMECOUNTER
    UINT32 notused_ispfcount[(0x648-0x644)/4];  // memory gap (without frame counter)
#endif  // MARVIN_FEATURE_FRAMECOUNTER

#if (MARVIN_FEATURE_XTALK_OFFSET == MARVIN_FEATURE_EXIST)
    UINT32 isp_ct_offset_r; // cross-talk offset red (rw) MRV_ISP_BASE + 0x0248
    UINT32 isp_ct_offset_g; // cross-talk offset green (rw) MRV_ISP_BASE + 0x024c
    UINT32 isp_ct_offset_b; // cross-talk offset blue (rw) MRV_ISP_BASE + 0x0250
    UINT32 notused_ispctoffs[(0x660-0x654)/4];   // memory gap (with ct offset)
#else   // MARVIN_FEATURE_XTALK_OFFSET
    UINT32 notused_ispctoffs[(0x660-0x648)/4];   // memory gap (without ct offset)
#endif  // MARVIN_FEATURE_XTALK_OFFSET

#if (MARVIN_FEATURE_FLASH_LIGHT == MARVIN_FEATURE_EXIST)
    UINT32 isp_flash_cmd; // Flash command (w) MRV_FLASH_BASE + 0x0000
    UINT32 isp_flash_config; // Flash config (rw) MRV_FLASH_BASE + 0x0004
    UINT32 isp_flash_prediv; // Flash Counter Pre-Divider (rw) MRV_FLASH_BASE + 0x0008
    UINT32 isp_flash_delay; // Flash Delay (rw) MRV_FLASH_BASE + 0x000c
    UINT32 isp_flash_time; // Flash time (rw) MRV_FLASH_BASE + 0x0010
    UINT32 isp_flash_maxp; // Maximum value for flash or preflash (rw) MRV_FLASH_BASE + 0x0014
    UINT32 notused_ispflash[(0x680-0x678)/4];   // memory gap (with flash light)
#else   // MARVIN_FEATURE_FLASH_LIGHT
    UINT32 notused_ispflash[(0x680-0x660)/4];   // memory gap (without flash light)
#endif  // MARVIN_FEATURE_FLASH_LIGHT

#if (MARVIN_FEATURE_SHUTTER == MARVIN_FEATURE_EXIST)
    UINT32 isp_sh_ctrl; // mechanical shutter control (rw) MRV_SHUT_BASE + 0x0000
    UINT32 isp_sh_prediv; // Mech. Shutter Counter Pre-Divider (rw) MRV_SHUT_BASE + 0x0004
    UINT32 isp_sh_delay; // Delay register (rw) MRV_SHUT_BASE + 0x0008
    UINT32 isp_sh_time; // Time register (rw) MRV_SHUT_BASE + 0x000c
    UINT32 notused_ispsh[(0x800-0x690)/4];      // memory gap (with shutter)
#else   // MARVIN_FEATURE_SHUTTER
    UINT32 notused_ispsh[(0x800-0x680)/4];      // memory gap (without shutter)
#endif  // MARVIN_FEATURE_SHUTTER

    UINT32 c_proc_ctrl; // Global control register (rw) MRV_CPROC_BASE + 0x0000
    UINT32 c_proc_contrast; // Color Processing contrast register (rw) MRV_CPROC_BASE + 0x0004
    UINT32 c_proc_brightness; // Color Processing brightness register (rw) MRV_CPROC_BASE + 0x0008
    UINT32 c_proc_saturation; // Color Processing saturation register (rw) MRV_CPROC_BASE + 0x000c
    UINT32 c_proc_hue; // Color Processing hue register (rw) MRV_CPROC_BASE + 0x0010
    UINT32 notused_cproc[(0xC00-0x814)/4];      // memory gap

#if (MARVIN_FEATURE_MSCALE_UP == MARVIN_FEATURE_EXIST)
    UINT32 mrsz_ctrl; // global control register (rw) MRV_MRSZ_BASE + 0x0000
    UINT32 mrsz_scale_hy; // horizontal luminance scale factor register (rw) MRV_MRSZ_BASE + 0x0004
    UINT32 mrsz_scale_hcb; // horizontal Cb scale factor register (rw) MRV_MRSZ_BASE + 0x0008
    UINT32 mrsz_scale_hcr; // horizontal Cr scale factor register (rw) MRV_MRSZ_BASE + 0x000c
    UINT32 mrsz_scale_vy; // vertical luminance scale factor register (rw) MRV_MRSZ_BASE + 0x0010
    UINT32 mrsz_scale_vc; // vertical chrominance scale factor register (rw) MRV_MRSZ_BASE + 0x0014
    UINT32 mrsz_phase_hy; // horizontal luminance phase register (rw) MRV_MRSZ_BASE + 0x0018
    UINT32 mrsz_phase_hc; // horizontal chrominance phase register (rw) MRV_MRSZ_BASE + 0x001c
    UINT32 mrsz_phase_vy; // vertical luminance phase register (rw) MRV_MRSZ_BASE + 0x0020
    UINT32 mrsz_phase_vc; // vertical chrominance phase register (rw) MRV_MRSZ_BASE + 0x0024
    UINT32 mrsz_scale_lut_addr; // Address pointer of up-scaling look up table (rw) MRV_MRSZ_BASE + 0x0028
    UINT32 mrsz_scale_lut; // Entry of up-scaling look up table (rw) MRV_MRSZ_BASE + 0x002c
    UINT32 mrsz_ctrl_shd; // global control shadow register (r) MRV_MRSZ_BASE + 0x0030
    UINT32 mrsz_scale_hy_shd; // horizontal luminance scale factor shadow register (r) MRV_MRSZ_BASE + 0x0034
    UINT32 mrsz_scale_hcb_shd; // horizontal Cb scale factor shadow register (r) MRV_MRSZ_BASE + 0x0038
    UINT32 mrsz_scale_hcr_shd; // horizontal Cr scale factor shadow register (r) MRV_MRSZ_BASE + 0x003c
    UINT32 mrsz_scale_vy_shd; // vertical luminance scale factor shadow register (r) MRV_MRSZ_BASE + 0x0040
    UINT32 mrsz_scale_vc_shd; // vertical chrominance scale factor shadow register (r) MRV_MRSZ_BASE + 0x0044
    UINT32 mrsz_phase_hy_shd; // horizontal luminance phase shadow register (r) MRV_MRSZ_BASE + 0x0048
    UINT32 mrsz_phase_hc_shd; // horizontal chrominance phase shadow register (r) MRV_MRSZ_BASE + 0x004c
    UINT32 mrsz_phase_vy_shd; // vertical luminance phase shadow register (r) MRV_MRSZ_BASE + 0x0050
    UINT32 mrsz_phase_vc_shd; // vertical chrominance phase shadow register (r) MRV_MRSZ_BASE + 0x0054
    UINT32 notused_mrsz[(0x1000-0x0C58)/4];     // memory gap
#else  // MARVIN_FEATURE_MSCALE_UP
    UINT32 mrsz_ctrl; // global control register (rw) MRV_MRSZ_BASE + 0x0000
    UINT32 mrsz_scale_hy; // horizontal luminance scale factor register (rw) MRV_MRSZ_BASE + 0x0004
    UINT32 mrsz_scale_hc; // horizontal chrominance scale factor register (rw) MRV_MRSZ_BASE + 0x0008
    UINT32 mrsz_scale_vy; // vertical luminance scale factor register (rw) MRV_MRSZ_BASE + 0x000c
    UINT32 mrsz_scale_vc; // vertical chrominance scale factor register (rw) MRV_MRSZ_BASE + 0x0010
    UINT32 mrsz_phase_hy; // horizontal luminance phase register (rw) MRV_MRSZ_BASE + 0x0014
    UINT32 mrsz_phase_hc; // horizontal chrominance phase register (rw) MRV_MRSZ_BASE + 0x0018
    UINT32 mrsz_phase_vy; // vertical luminance phase register (rw) MRV_MRSZ_BASE + 0x001c
    UINT32 mrsz_phase_vc; // vertical chrominance phase register (rw) MRV_MRSZ_BASE + 0x0020
    UINT32 mrsz_ctrl_shd; // global control shadow register (r) MRV_MRSZ_BASE + 0x0024
    UINT32 mrsz_scale_hy_shd; // horizontal luminance scale factor shadow register (r) MRV_MRSZ_BASE + 0x0028
    UINT32 mrsz_scale_hc_shd; // horizontal chromninance scale factor shadow register (r) MRV_MRSZ_BASE + 0x002c
    UINT32 mrsz_scale_vy_shd; // vertical luminance scale factor shadow register (r) MRV_MRSZ_BASE + 0x0030
    UINT32 mrsz_scale_vc_shd; // vertical chrominance scale factor shadow register (r) MRV_MRSZ_BASE + 0x0034
    UINT32 mrsz_phase_hy_shd; // horizontal luminance phase shadow register (r) MRV_MRSZ_BASE + 0x0038
    UINT32 mrsz_phase_hc_shd; // horizontal chrominance phase shadow register (r) MRV_MRSZ_BASE + 0x003c
    UINT32 mrsz_phase_vy_shd; // vertical luminance phase shadow register (r) MRV_MRSZ_BASE + 0x0040
    UINT32 mrsz_phase_vc_shd; // vertical chrominance phase shadow register (r) MRV_MRSZ_BASE + 0x0044
    UINT32 notused_mrsz[(0x1000-0xC48)/4];      // memory gap
#endif  // MARVIN_FEATURE_MSCALE_UP

#if (MARVIN_FEATURE_SSCALE == MARVIN_FEATURE_EXIST)
  #if (MARVIN_FEATURE_SSCALE_UP == MARVIN_FEATURE_EXIST)
    UINT32 srsz_ctrl; // global control register (rw) MRV_SRSZ_BASE + 0x0000
    UINT32 srsz_scale_hy; // horizontal luminance scale factor register (rw) MRV_SRSZ_BASE + 0x0004
    UINT32 srsz_scale_hcb; // horizontal chrominance scale factor register (rw) MRV_SRSZ_BASE + 0x0008
    UINT32 srsz_scale_hcr; // horizontal chrominance scale factor register (rw) MRV_SRSZ_BASE + 0x000c
    UINT32 srsz_scale_vy; // vertical luminance scale factor register (rw) MRV_SRSZ_BASE + 0x0010
    UINT32 srsz_scale_vc; // vertical chrominance scale factor register (rw) MRV_SRSZ_BASE + 0x0014
    UINT32 srsz_phase_hy; // horizontal luminance phase register (rw) MRV_SRSZ_BASE + 0x0018
    UINT32 srsz_phase_hc; // horizontal chrominance phase register (rw) MRV_SRSZ_BASE + 0x001c
    UINT32 srsz_phase_vy; // vertical luminance phase register (rw) MRV_SRSZ_BASE + 0x0020
    UINT32 srsz_phase_vc; // vertical chrominance phase register (rw) MRV_SRSZ_BASE + 0x0024
    UINT32 srsz_scale_lut_addr; // Address pointer of up-scaling look up table (rw) MRV_SRSZ_BASE + 0x0028
    UINT32 srsz_scale_lut; // Entry of up-scaling look up table (rw) MRV_SRSZ_BASE + 0x002c
    UINT32 srsz_ctrl_shd; // global control shadow register (r) MRV_SRSZ_BASE + 0x0030
    UINT32 srsz_scale_hy_shd; // horizontal luminance scale factor shadow register (r) MRV_SRSZ_BASE + 0x0034
    UINT32 srsz_scale_hcb_shd; // horizontal Cb scale factor shadow register (r) MRV_SRSZ_BASE + 0x0038
    UINT32 srsz_scale_hcr_shd; // horizontal Cr scale factor shadow register (r) MRV_SRSZ_BASE + 0x003c
    UINT32 srsz_scale_vy_shd; // vertical luminance scale factor shadow register (r) MRV_SRSZ_BASE + 0x0040
    UINT32 srsz_scale_vc_shd; // vertical chrominance scale factor shadow register (r) MRV_SRSZ_BASE + 0x0044
    UINT32 srsz_phase_hy_shd; // horizontal luminance phase shadow register (r) MRV_SRSZ_BASE + 0x0048
    UINT32 srsz_phase_hc_shd; // horizontal chrominance phase shadow register (r) MRV_SRSZ_BASE + 0x004c
    UINT32 srsz_phase_vy_shd; // vertical luminance phase shadow register (r) MRV_SRSZ_BASE + 0x0050
    UINT32 srsz_phase_vc_shd; // vertical chrominance phase shadow register (r) MRV_SRSZ_BASE + 0x0054
    UINT32 notused_srsz[(0x1400-0x1058)/4];     // memory gap
  #else   // MARVIN_FEATURE_SSCALE_UP
    UINT32 srsz_ctrl;                           // 0x1000 self-picture resize control register
    UINT32 srsz_scale_hy;                       // 0x1004 self-picture resize horizontal luminance scale factor
    UINT32 srsz_scale_hc;                       // 0x1008 self-picture resize horizontal chrominance scale factor
    UINT32 srsz_scale_vy;                       // 0x100C self-picture resize vertical luminance scale factor
    UINT32 srsz_scale_vc;                       // 0x1010 self-picture resize vertical chrominance scale factor
    UINT32 srsz_phase_hy;                       // 0x1014 self-picture resize horizontal luminance phase offset
    UINT32 srsz_phase_hc;                       // 0x1018 self-picture resize horizontal chrominance phase offset
    UINT32 srsz_phase_vy;                       // 0x101C self-picture resize vertical luminance phase offset
    UINT32 srsz_phase_vc;                       // 0x1020 self-picture resize vertical chrominance phase offset
    UINT32 srsz_ctrl_shd;                       // 0x1024 self-picture resize control register shadow register
    UINT32 srsz_scale_hy_shd;                   // 0x1028 self-picture resize horizontal luminance scale factor shadow register
    UINT32 srsz_scale_hc_shd;                   // 0x102C self-picture resize horizontal chrominance scale factor shadow register
    UINT32 srsz_scale_vy_shd;                   // 0x1030 self-picture resize vertical luminance scale factor shadow register
    UINT32 srsz_scale_vc_shd;                   // 0x1034 self-picture resize vertical chrominance scale factor shadow register
    UINT32 srsz_phase_hy_shd;                   // 0x1038 self-picture resize horizontal luminance phase offset shadow register
    UINT32 srsz_phase_hc_shd;                   // 0x103C self-picture resize horizontal chrominance phase offset shadow register
    UINT32 srsz_phase_vy_shd;                   // 0x1040 self-picture resize vertical luminance phase offset shadow register
    UINT32 srsz_phase_vc_shd;                   // 0x1044 self-picture resize vertical chrominance phase offset shadow register
    UINT32 notused_srsz[(0x1400-0x1048)/4];     // memory gap
  #endif  // MARVIN_FEATURE_SSCALE_UP
#else  // MARVIN_FEATURE_SSCALE
    UINT32 notused_srsz[(0x1400-0x1000)/4];     // memory gap
#endif // MARVIN_FEATURE_SSCALE

#if (MARVIN_FEATURE_SMALL_OUTUNIT == MARVIN_FEATURE_EXIST)
    UINT32 emp_out_ctrl; // global control register (rw) MRV_SOUT_BASE + 0x0000
//    UINT32 sml_out_ctrl;                        // 0x1400 small output control register
    UINT32 notused_mi3[(0x14C8-0x1404)/4];      // memory gap
    UINT32 emp_out_imsc; // Interrupt Mask (rw) MRV_SOUT_BASE + 0x00c8
    UINT32 emp_out_ris; // Raw Interrupt Status (r) MRV_SOUT_BASE + 0x00cc
    UINT32 emp_out_mis; // Masked Interrupt Status (r) MRV_SOUT_BASE + 0x00d0
    UINT32 emp_out_icr; // Interrupt Clear Register (w) MRV_SOUT_BASE + 0x00d4
    UINT32 emp_out_isr; // Interrupt Set Register (w) MRV_SOUT_BASE + 0x00d8
//    UINT32 sml_out_imsc;                        // 0x14C8 small output interrupt mask register
//    UINT32 sml_out_ris;                         // 0x14CC small output raw interrupt status
//    UINT32 sml_out_mis;                         // 0x14D0 small output masked interrupt status
//    UINT32 sml_out_icr;                         // 0x14D4 small output interrupt clear register
//    UINT32 sml_out_isr;                         // 0x14D8 small output interrupt set register
    UINT32 notused_mi4[(0x1600-0x14DC)/4];      // memory gap
#if (MARVIN_FEATURE_MI == MARVIN_FEATURE_MI_V1)
    UINT32 mi_ctrl;                             // 0x1600 memory interface control register
    UINT32 mi_init;                             // 0x1604 main picture initialization registers
    UINT32 mi_mp_y_base_ad_init;                // 0x1608 main picture Y component or JPEG ring buffer base address
    UINT32 mi_mp_y_size_init;                   // 0x160C main picture Y component or JPEG ring buffer size
    UINT32 mi_mp_y_offs_cnt_init;               // 0x1610 main picture Y component or JPEG start offset
    UINT32 mi_mp_y_offs_cnt_start;              // 0x1614 current main picture Y component or JPEG start offset
    UINT32 mi_mp_y_irq_offs_init;               // 0x1618 main picture Y component or JPEG ring buffer interrupt offset
    UINT32 mi_mp_cb_base_ad_init;               // 0x161C main picture Cb component ring buffer base address
    UINT32 mi_mp_cb_size_init;                  // 0x1620 main picture Cb component buffer size
    UINT32 mi_mp_cb_offs_cnt_init;              // 0x1624 main picture Cb component start offset
    UINT32 mi_mp_cb_offs_cnt_start;             // 0x1628 current main picture Cb component start offset
    UINT32 mi_mp_cr_base_ad_init;               // 0x162C main picture Cr component ring buffer base address
    UINT32 mi_mp_cr_size_init;                  // 0x1630 main picture Cr component buffer size
    UINT32 mi_mp_cr_offs_cnt_init;              // 0x1634 main picture Cr component start offset
    UINT32 mi_mp_cr_offs_cnt_start;             // 0x1638 current main picture Cr component start offset
    UINT32 mi_sp_y_base_ad_init;                // 0x163C self-picture picture Y component or JPEG ring buffer base address
    UINT32 mi_sp_y_size_init;                   // 0x1640 self-picture picture Y component or JPEG ring buffer size
    UINT32 mi_sp_y_offs_cnt_init;               // 0x1644 self-picture picture Y component or JPEG start offset
    UINT32 mi_sp_y_offs_cnt_start;              // 0x1648 current self-picture picture Y component or JPEG start offset
    UINT32 mi_sp_y_llength;                     // 0x164C self-picture line length
    UINT32 mi_sp_cb_base_ad_init;               // 0x1650 self-picture Cb component ring buffer base address
    UINT32 mi_sp_cb_size_init;                  // 0x1654 self-picture Cb component buffer size
    UINT32 mi_sp_cb_offs_cnt_init;              // 0x1658 self-picture Cb component start offset
    UINT32 mi_sp_cb_offs_cnt_start;             // 0x165C current main picture Cb component start offset
    UINT32 mi_sp_cr_base_ad_init;               // 0x1660 self-picture Cr component ring buffer base address
    UINT32 mi_sp_cr_size_init;                  // 0x1664 self-picture Cr component buffer size
    UINT32 mi_sp_cr_offs_cnt_init;              // 0x1668 self-picture Cr component start offset
    UINT32 mi_sp_cr_offs_cnt_start;             // 0x166C current main picture Cr component start offset
    UINT32 mi_byte_cnt;                         // 0x1670 byte counter for JPEG and raw data
    UINT32 mi_ctrl_shd;                         // 0x1674 MI control shadow register
    UINT32 mi_mp_y_base_ad_shd;                 // 0x1678 main picture Y component or JPEG ring buffer base address
    UINT32 mi_mp_y_size_shd;                    // 0x167C main picture Y component or JPEG ring buffer size shadow
    UINT32 mi_mp_y_offs_cnt_shd;                // 0x1680 main picture Y component or JPEG start offset shadow register
    UINT32 mi_mp_y_irq_offs_shd ;               // 0x1684 main picture Y component or JPEG ring buffer interrupt
    UINT32 mi_mp_cb_base_ad_shd;                // 0x1688 main picture Cb component ring buffer base address shadow register
    UINT32 mi_mp_cb_size_shd;                   // 0x168C main picture Cb component ring buffer size shadow register
    UINT32 mi_mp_cb_offs_cnt_shd;               // 0x1690 main picture Cb component ring buffer start offset shadow register
    UINT32 mi_mp_cr_base_ad_shd;                // 0x1694 main picture Cr component ring buffer base address shadow register
    UINT32 mi_mp_cr_size_shd;                   // 0x1698 main picture Cr component ring buffer size shadow register
    UINT32 mi_mp_cr_offs_cnt_shd;               // 0x169C main picture Cr component ring buffer start offset shadow register
    UINT32 mi_sp_y_base_ad_shd;                 // 0x16A0 self-picture picture Y component or JPEG ring buffer base address
    UINT32 mi_sp_y_size_shd;                    // 0x16A4 self-picture picture Y component or JPEG ring buffer size shadow
    UINT32 mi_sp_y_offs_cnt_shd;                // 0x16A8 self-picture picture Y component or JPEG start offset shadow register
    UINT32 mi_sp_llength_shd;                   // 0x16AC self-picture line length shadow register
    UINT32 mi_sp_cb_base_ad_shd;                // 0x16B0 self-picture Cb component ring buffer base address shadow register
    UINT32 mi_sp_cb_size_shd;                   // 0x16B4 self-picture Cb component buffer size shadow register
    UINT32 mi_sp_cb_offs_cnt_shd;               // 0x16B8 self-picture Cb component start offset shadow register
    UINT32 mi_sp_cr_base_ad_shd;                // 0x16BC self-picture Cr component ring buffer base address shadow register
    UINT32 mi_sp_cr_size_shd;                   // 0x16C0 self-picture Cr component buffer size shadow register
    UINT32 mi_sp_cr_offs_cnt_shd;               // 0x16C4 self-picture Cr component start offset shadow register
    UINT32 mi_imsc;                             // 0x16C8 MI interrupt mask register
    UINT32 mi_ris;                              // 0x16CC MI raw interrupt status
    UINT32 mi_mis;                              // 0x16D0 MI masked interrupt status
    UINT32 mi_icr;                              // 0x16D4 MI interrupt clear register
    UINT32 mi_isr;                              // 0x16D8 MI interrupt set register
    UINT32 notused_mi5[(0x1800-0x16DC)/4];      // memory gap
    #elif (MARVIN_FEATURE_MI == MARVIN_FEATURE_MI_V4)
    UINT32 mi_ctrl; // Global control register (rw) MRV_SOUT_BASE + 0x0200 + 0x0000
    UINT32 mi_init; // Control register for address init and skip function (w) MRV_SOUT_BASE + 0x0200 + 0x0004
    UINT32 mi_mp_y_base_ad_init; // Base address for main picture Y component, JPEG or raw data (rw) MRV_SOUT_BASE + 0x0200 + 0x0008
    UINT32 mi_mp_y_size_init; // Size of main picture Y component, JPEG or raw data (rw) MRV_SOUT_BASE + 0x0200 + 0x000c
    UINT32 mi_mp_y_offs_cnt_init; // Offset counter init value for main picture Y, JPEG or raw data (rw) MRV_SOUT_BASE + 0x0200 + 0x0010
    UINT32 mi_mp_y_offs_cnt_start; // Offset counter start value for main picture Y, JPEG or raw data (r) MRV_SOUT_BASE + 0x0200 + 0x0014
    UINT32 mi_mp_y_irq_offs_init; // Fill level interrupt offset value for main picture Y, JPEG or raw data (rw) MRV_SOUT_BASE + 0x0200 + 0x0018
    UINT32 mi_mp_cb_base_ad_init; // Base address for main picture Cb component ring buffer (rw) MRV_SOUT_BASE + 0x0200 + 0x001c
    UINT32 mi_mp_cb_size_init; // Size of main picture Cb component ring buffer (rw) MRV_SOUT_BASE + 0x0200 + 0x0020
    UINT32 mi_mp_cb_offs_cnt_init; // Offset counter init value for main picture Cb component ring buffer (rw) MRV_SOUT_BASE + 0x0200 + 0x0024
    UINT32 mi_mp_cb_offs_cnt_start; // Offset counter start value for main picture Cb component ring buffer (r) MRV_SOUT_BASE + 0x0200 + 0x0028
    UINT32 mi_mp_cr_base_ad_init; // Base address for main picture Cr component ring buffer (rw) MRV_SOUT_BASE + 0x0200 + 0x002c
    UINT32 mi_mp_cr_size_init; // Size of main picture Cr component ring buffer (rw) MRV_SOUT_BASE + 0x0200 + 0x0030
    UINT32 mi_mp_cr_offs_cnt_init; // Offset counter init value for main picture Cr component ring buffer (rw) MRV_SOUT_BASE + 0x0200 + 0x0034
    UINT32 mi_mp_cr_offs_cnt_start; // Offset counter start value for main picture Cr component ring buffer (r) MRV_SOUT_BASE + 0x0200 + 0x0038
    UINT32 mi_sp_y_base_ad_init; // Base address for self picture Y component ring buffer (rw) MRV_SOUT_BASE + 0x0200 + 0x003c
    UINT32 mi_sp_y_size_init; // Size of self picture Y component ring buffer (rw) MRV_SOUT_BASE + 0x0200 + 0x0040
    UINT32 mi_sp_y_offs_cnt_init; // Offset counter init value for self picture Y component ring buffer (rw) MRV_SOUT_BASE + 0x0200 + 0x0044
    UINT32 mi_sp_y_offs_cnt_start; // Offset counter start value for self picture Y component ring buffer (r) MRV_SOUT_BASE + 0x0200 + 0x0048
    UINT32 mi_sp_y_llength; // Line length of self picture Y component (rw) MRV_SOUT_BASE + 0x0200 + 0x004c
    UINT32 mi_sp_cb_base_ad_init; // Base address for self picture Cb component ring buffer (rw) MRV_SOUT_BASE + 0x0200 + 0x0050
    UINT32 mi_sp_cb_size_init; // Size of self picture Cb component ring buffer (rw) MRV_SOUT_BASE + 0x0200 + 0x0054
    UINT32 mi_sp_cb_offs_cnt_init; // Offset counter init value for self picture Cb component ring buffer (rw) MRV_SOUT_BASE + 0x0200 + 0x0058
    UINT32 mi_sp_cb_offs_cnt_start; // Offset counter start value for self picture Cb component ring buffer (r) MRV_SOUT_BASE + 0x0200 + 0x005c
    UINT32 mi_sp_cr_base_ad_init; // Base address for self picture Cr component ring buffer (rw) MRV_SOUT_BASE + 0x0200 + 0x0060
    UINT32 mi_sp_cr_size_init; // Size of self picture Cr component ring buffer (rw) MRV_SOUT_BASE + 0x0200 + 0x0064
    UINT32 mi_sp_cr_offs_cnt_init; // Offset counter init value for self picture Cr component ring buffer (rw) MRV_SOUT_BASE + 0x0200 + 0x0068
    UINT32 mi_sp_cr_offs_cnt_start; // Offset counter start value for self picture Cr component ring buffer (r) MRV_SOUT_BASE + 0x0200 + 0x006c
    UINT32 mi_byte_cnt; // Counter value of JPEG or RAW data bytes (r) MRV_SOUT_BASE + 0x0200 + 0x0070
    UINT32 mi_ctrl_shd; // global control internal shadow register (r) MRV_SOUT_BASE + 0x0200 + 0x0074
    UINT32 mi_mp_y_base_ad_shd; // Base address shadow register for main picture Y component, JPEG or raw data ring buffer (r) MRV_SOUT_BASE + 0x0200 + 0x0078
    UINT32 mi_mp_y_size_shd; // Size shadow register of main picture Y component, JPEG or raw data (r) MRV_SOUT_BASE + 0x0200 + 0x007c
    UINT32 mi_mp_y_offs_cnt_shd; // Current offset counter of main picture Y component, JPEG or raw data ring buffer (r) MRV_SOUT_BASE + 0x0200 + 0x0080
    UINT32 mi_mp_y_irq_offs_shd; // Shadow register of fill level interrupt offset value for main picture Y component, JPEG or raw data (r) MRV_SOUT_BASE + 0x0200 + 0x0084
    UINT32 mi_mp_cb_base_ad_shd; // Base address shadow register for main picture Cb component ring buffer (r) MRV_SOUT_BASE + 0x0200 + 0x0088
    UINT32 mi_mp_cb_size_shd; // Size shadow register of main picture Cb component ring buffer (r) MRV_SOUT_BASE + 0x0200 + 0x008c
    UINT32 mi_mp_cb_offs_cnt_shd; // Current offset counter of main picture Cb component ring buffer (r) MRV_SOUT_BASE + 0x0200 + 0x0090
    UINT32 mi_mp_cr_base_ad_shd; // Base address shadow register for main picture Cr component ring buffer (r) MRV_SOUT_BASE + 0x0200 + 0x0094
    UINT32 mi_mp_cr_size_shd; // Size shadow register of main picture Cr component ring buffer (r) MRV_SOUT_BASE + 0x0200 + 0x0098
    UINT32 mi_mp_cr_offs_cnt_shd; // Current offset counter of main picture Cr component ring buffer (r) MRV_SOUT_BASE + 0x0200 + 0x009c
    UINT32 mi_sp_y_base_ad_shd; // Base address shadow register for self picture Y component ring buffer (r) MRV_SOUT_BASE + 0x0200 + 0x00a0
    UINT32 mi_sp_y_size_shd; // Size shadow register of self picture Y component ring buffer (r) MRV_SOUT_BASE + 0x0200 + 0x00a4
    UINT32 mi_sp_y_offs_cnt_shd; // Current offset counter of self picture Y component ring buffer (r) MRV_SOUT_BASE + 0x0200 + 0x00a8

    UINT32 notused_so1;                         // 0x16AC

    UINT32 mi_sp_cb_base_ad_shd; // Base address shadow register for self picture Cb component ring buffer (r) MRV_SOUT_BASE + 0x0200 + 0x00b0
    UINT32 mi_sp_cb_size_shd; // Size shadow register of self picture Cb component ring buffer (r) MRV_SOUT_BASE + 0x0200 + 0x00b4
    UINT32 mi_sp_cb_offs_cnt_shd; // Current offset counter of self picture Cb component ring buffer (r) MRV_SOUT_BASE + 0x0200 + 0x00b8
    UINT32 mi_sp_cr_base_ad_shd; // Base address shadow register for self picture Cr component ring buffer (r) MRV_SOUT_BASE + 0x0200 + 0x00bc
    UINT32 mi_sp_cr_size_shd; // Size shadow register of self picture Cr component ring buffer (r) MRV_SOUT_BASE + 0x0200 + 0x00c0
    UINT32 mi_sp_cr_offs_cnt_shd; // Current offset counter of self picture Cr component ring buffer (r) MRV_SOUT_BASE + 0x0200 + 0x00c4

    UINT32 mi_dma_y_pic_start_ad; // Y component image start address (rw) MRV_SOUT_BASE + 0x0200 + 0x00c8
    UINT32 mi_dma_y_pic_width; // Y component image width (rw) MRV_SOUT_BASE + 0x0200 + 0x00cc
    UINT32 mi_dma_y_llength; // Y component original line length (rw) MRV_SOUT_BASE + 0x0200 + 0x00d0
    UINT32 mi_dma_y_pic_size; // Y component image size (rw) MRV_SOUT_BASE + 0x0200 + 0x00d4
    UINT32 mi_dma_cb_pic_start_ad; // Cb component image start address (rw) MRV_SOUT_BASE + 0x0200 + 0x00d8

    UINT32 notused_so2[(0x16E8-0x16DC)/4];      // memory gap
    UINT32 mi_dma_cr_pic_start_ad; // Cr component image start address (rw) MRV_SOUT_BASE + 0x0200 + 0x00e8
    UINT32 notused_so3[(0x16F8-0x16EC)/4];      // memory gap
    UINT32 mi_imsc; // Interrupt Mask (‘1’: interrupt active, ‘0’: interrupt masked) (rw) MRV_SOUT_BASE + 0x0200 + 0x00f8
    UINT32 mi_ris; // Raw Interrupt Status (r) MRV_SOUT_BASE + 0x0200 + 0x00fc
    UINT32 mi_mis; // Masked Interrupt Status (r) MRV_SOUT_BASE + 0x0200 + 0x0100
    UINT32 mi_icr; // Interrupt Clear Register (w) MRV_SOUT_BASE + 0x0200 + 0x0104
    UINT32 mi_isr; // Interrupt Set Register (w) MRV_SOUT_BASE + 0x0200 + 0x0108

  #if (MARVIN_FEATURE_MI_STATUSFLAGS == MARVIN_FEATURE_EXIST)
    UINT32 mi_status; // MI Status Register (r) MRV_SOUT_BASE + 0x0200 + 0x010c
    UINT32 mi_status_clr; // MI Status Clear Register (w) MRV_SOUT_BASE + 0x0200 + 0x0110
  #else   // MARVIN_FEATURE_MI_STATUSFLAGS
    UINT32 notused_so5[(0x1714-0x170C)/4];      // memory gap
  #endif  // MARVIN_FEATURE_MI_STATUSFLAGS

    UINT32 mi_sp_y_pic_width; // Y component image width (rw) MRV_SOUT_BASE + 0x0200 + 0x0114
    UINT32 mi_sp_y_pic_height; // Y component image height (rw) MRV_SOUT_BASE + 0x0200 + 0x0118
    UINT32 mi_sp_y_pic_size; // Y component image size (rw) MRV_SOUT_BASE + 0x0200 + 0x011c
    UINT32 mi_dma_ctrl; // DMA control register (rw) MRV_SOUT_BASE + 0x0200 + 0x0120
    UINT32 mi_dma_start; // DMA start register (w) MRV_SOUT_BASE + 0x0200 + 0x0124
    UINT32 mi_dma_status; // DMA status register (r) MRV_SOUT_BASE + 0x0200 + 0x0128
    UINT32 notused_so6[(0x1800-0x172C)/4];      // memory gap
    #else // (MARVIN_FEATURE_MI == MARVIN_FEATURE_MI_V4)
    #error "not supported MI version with small output unit"
    #endif // (MARVIN_FEATURE_MI == MARVIN_FEATURE_MI_V4)
#else  // MARVIN_FEATURE_SMALL_OUTUNIT
    UINT32 mi_ctrl; // Global control register (rw) MRV_MI_BASE + 0x0000
    UINT32 mi_init; // Control register for address init and skip function (w) MRV_MI_BASE + 0x0004
    UINT32 mi_mp_y_base_ad_init; // Base address for main picture Y component, JPEG or raw data (rw) MRV_MI_BASE + 0x0008
//    UINT32 mi_mp_y_base_adr;                    // 0x1408 main picture Y component or JPEG ring buffer base address
    UINT32 mi_mp_y_size_init; // Size of main picture Y component, JPEG or raw data (rw) MRV_MI_BASE + 0x000c
//    UINT32 mi_mp_y_size;                        // 0x140C main picture Y component or JPEG ring buffer size
    UINT32 mi_mp_y_offs_cnt_init; // Offset counter init value for main picture Y, JPEG or raw data (rw) MRV_MI_BASE + 0x0010
//    UINT32 mi_mp_y_offs;                        // 0x1410 main picture Y component or JPEG start offset
    UINT32 mi_mp_y_offs_cnt_start; // Offset counter start value for main picture Y, JPEG or raw data (r) MRV_MI_BASE + 0x0014
//    UINT32 mi_mp_y_offs_start;                  // 0x1414 current main picture Y component or JPEG start offset
    UINT32 mi_mp_y_irq_offs_init; // Fill level interrupt offset value for main picture Y, JPEG or raw data (rw) MRV_MI_BASE + 0x0018
//    UINT32 mi_mp_irq_offs;                      // 0x1418 main picture Y component or JPEG ring buffer interrupt offset
    UINT32 mi_mp_cb_base_ad_init; // Base address for main picture Cb component ring buffer (rw) MRV_MI_BASE + 0x001c
//    UINT32 mi_mp_cb_base_adr;                   // 0x141C main picture Cb component ring buffer base address
    UINT32 mi_mp_cb_size_init; // Size of main picture Cb component ring buffer (rw) MRV_MI_BASE + 0x0020
//    UINT32 mi_mp_cb_size;                       // 0x1420 main picture Cb component buffer size
    UINT32 mi_mp_cb_offs_cnt_init; // Offset counter init value for main picture Cb component ring buffer (rw) MRV_MI_BASE + 0x0024
//    UINT32 mi_mp_cb_offs;                       // 0x1424 main picture Cb component start offset
    UINT32 mi_mp_cb_offs_cnt_start; // Offset counter start value for main picture Cb component ring buffer (r) MRV_MI_BASE + 0x0028
//    UINT32 mi_mp_cb_offs_start;                 // 0x1428 current main picture Cb component start offset
    UINT32 mi_mp_cr_base_ad_init; // Base address for main picture Cr component ring buffer (rw) MRV_MI_BASE + 0x002c
//    UINT32 mi_mp_cr_base_adr;                   // 0x142C main picture Cr component ring buffer base address
    UINT32 mi_mp_cr_size_init; // Size of main picture Cr component ring buffer (rw) MRV_MI_BASE + 0x0030
//    UINT32 mi_mp_cr_size;                       // 0x1430 main picture Cr component buffer size
    UINT32 mi_mp_cr_offs_cnt_init; // Offset counter init value for main picture Cr component ring buffer (rw) MRV_MI_BASE + 0x0034
//    UINT32 mi_mp_cr_offs;                       // 0x1434 main picture Cr component start offset
    UINT32 mi_mp_cr_offs_cnt_start; // Offset counter start value for main picture Cr component ring buffer (r) MRV_MI_BASE + 0x0038
//    UINT32 mi_mp_cr_offs_start;                 // 0x1438 current main picture Cr component start offset
    UINT32 mi_sp_y_base_ad_init; // Base address for self picture Y component ring buffer (rw) MRV_MI_BASE + 0x003c
//    UINT32 mi_sp_y_base_adr;                    // 0x143C self-picture picture Y component or JPEG ring buffer base address
    UINT32 mi_sp_y_size_init; // Size of self picture Y component ring buffer (rw) MRV_MI_BASE + 0x0040
//    UINT32 mi_sp_y_size;                        // 0x1440 self-picture picture Y component or JPEG ring buffer size
    UINT32 mi_sp_y_offs_cnt_init; // Offset counter init value for self picture Y component ring buffer (rw) MRV_MI_BASE + 0x0044
//    UINT32 mi_sp_y_offs;                        // 0x1444 self-picture picture Y component or JPEG start offset
    UINT32 mi_sp_y_offs_cnt_start; // Offset counter start value for self picture Y component ring buffer (r) MRV_MI_BASE + 0x0048
//    UINT32 mi_sp_y_offs_start;                  // 0x1448 current self-picture picture Y component or JPEG start offset
    UINT32 mi_sp_y_llength; // Line length of self picture Y component (rw) MRV_MI_BASE + 0x004c
//    UINT32 mi_sp_llength;                       // 0x144C self-picture line length
    UINT32 mi_sp_cb_base_ad_init; // Base address for self picture Cb component ring buffer (rw) MRV_MI_BASE + 0x0050
//    UINT32 mi_sp_cb_base_adr;                   // 0x1450 self-picture Cb component ring buffer base address
    UINT32 mi_sp_cb_size_init; // Size of self picture Cb component ring buffer (rw) MRV_MI_BASE + 0x0054
//    UINT32 mi_sp_cb_size;                       // 0x1454 self-picture Cb component buffer size
    UINT32 mi_sp_cb_offs_cnt_init; // Offset counter init value for self picture Cb component ring buffer (rw) MRV_MI_BASE + 0x0058
//    UINT32 mi_sp_cb_offs;                       // 0x1458 self-picture Cb component start offset
    UINT32 mi_sp_cb_offs_cnt_start; // Offset counter start value for self picture Cb component ring buffer (r) MRV_MI_BASE + 0x005c
//    UINT32 mi_sp_cb_offs_start;                 // 0x145C current main picture Cb component start offset
    UINT32 mi_sp_cr_base_ad_init; // Base address for self picture Cr component ring buffer (rw) MRV_MI_BASE + 0x0060
//    UINT32 mi_sp_cr_base_adr;                   // 0x1460 self-picture Cr component ring buffer base address
    UINT32 mi_sp_cr_size_init; // Size of self picture Cr component ring buffer (rw) MRV_MI_BASE + 0x0064
//    UINT32 mi_sp_cr_size;                       // 0x1464 self-picture Cr component buffer size
    UINT32 mi_sp_cr_offs_cnt_init; // Offset counter init value for self picture Cr component ring buffer (rw) MRV_MI_BASE + 0x0068
//    UINT32 mi_sp_cr_offs;                       // 0x1468 self-picture Cr component start offset
    UINT32 mi_sp_cr_offs_cnt_start; // Offset counter start value for self picture Cr component ring buffer (r) MRV_MI_BASE + 0x006c
//    UINT32 mi_sp_cr_offs_start;                 // 0x146C current main picture Cr component start offset
    UINT32 mi_byte_cnt; // Counter value of JPEG or RAW data bytes (r) MRV_MI_BASE + 0x0070
    UINT32 mi_ctrl_shd; // global control internal shadow register (r) MRV_MI_BASE + 0x0074
    UINT32 mi_mp_y_base_ad_shd; // Base address shadow register for main picture Y component, JPEG or raw data ring buffer (r) MRV_MI_BASE + 0x0078
//    UINT32 mi_mp_y_base_adr_shd;                // 0x1478 main picture Y component or JPEG ring buffer base address
    UINT32 mi_mp_y_size_shd; // Size shadow register of main picture Y component, JPEG or raw data (r) MRV_MI_BASE + 0x007c
    UINT32 mi_mp_y_offs_cnt_shd; // Current offset counter of main picture Y component, JPEG or raw data ring buffer (r) MRV_MI_BASE + 0x0080
//    UINT32 mi_mp_y_offs_shd;                    // 0x1480 main picture Y component or JPEG start offset shadow register
    UINT32 mi_mp_y_irq_offs_shd; // Shadow register of fill level interrupt offset value for main picture Y component, JPEG or raw data (r) MRV_MI_BASE + 0x0084
    UINT32 mi_mp_cb_base_ad_shd; // Base address shadow register for main picture Cb component ring buffer (r) MRV_MI_BASE + 0x0088
//    UINT32 mi_mp_cb_base_adr_shd;               // 0x1488 main picture Cb component ring buffer base address shadow register
    UINT32 mi_mp_cb_size_shd; // Size shadow register of main picture Cb component ring buffer (r) MRV_MI_BASE + 0x008c
    UINT32 mi_mp_cb_offs_cnt_shd; // Current offset counter of main picture Cb component ring buffer (r) MRV_MI_BASE + 0x0090
//    UINT32 mi_mp_cb_offs_shd;                   // 0x1490 main picture Cb component ring buffer start offset shadow register
    UINT32 mi_mp_cr_base_ad_shd; // Base address shadow register for main picture Cr component ring buffer (r) MRV_MI_BASE + 0x0094
//    UINT32 mi_mp_cr_base_adr_shd;               // 0x1494 main picture Cr component ring buffer base address shadow register
    UINT32 mi_mp_cr_size_shd; // Size shadow register of main picture Cr component ring buffer (r) MRV_MI_BASE + 0x0098
    UINT32 mi_mp_cr_offs_cnt_shd; // Current offset counter of main picture Cr component ring buffer (r) MRV_MI_BASE + 0x009c
//    UINT32 mi_mp_cr_offs_shd;                   // 0x149C main picture Cr component ring buffer start offset shadow register
    UINT32 mi_sp_y_base_ad_shd; // Base address shadow register for self picture Y component ring buffer (r) MRV_MI_BASE + 0x00a0
//    UINT32 mi_sp_y_base_adr_shd;                // 0x14A0 self-picture picture Y component or JPEG ring buffer base address
    UINT32 mi_sp_y_size_shd; // Size shadow register of self picture Y component ring buffer (r) MRV_MI_BASE + 0x00a4
    UINT32 mi_sp_y_offs_cnt_shd; // Current offset counter of self picture Y component ring buffer (r) MRV_MI_BASE + 0x00a8
//    UINT32 mi_sp_y_offs_shd;                    // 0x14A8 self-picture picture Y component or JPEG start offset shadow register

  #if ((MARVIN_FEATURE_MI <= MARVIN_FEATURE_MI_V4) && (MARVIN_FEATURE_MI >= MARVIN_FEATURE_MI_V3))
    UINT32 notused_mi1;                         // 0x14AC
  #else   // MARVIN_FEATURE_MI
    UINT32 mi_sp_llength_shd;                   // 0x14AC self-picture line length shadow register
  #endif  // MARVIN_FEATURE_MI

    UINT32 mi_sp_cb_base_ad_shd; // Base address shadow register for self picture Cb component ring buffer (r) MRV_MI_BASE + 0x00b0
//    UINT32 mi_sp_cb_base_adr_shd;               // 0x14B0 self-picture Cb component ring buffer base address shadow register
    UINT32 mi_sp_cb_size_shd; // Size shadow register of self picture Cb component ring buffer (r) MRV_MI_BASE + 0x00b4
    UINT32 mi_sp_cb_offs_cnt_shd; // Current offset counter of self picture Cb component ring buffer (r) MRV_MI_BASE + 0x00b8
//    UINT32 mi_sp_cb_offs_shd;                   // 0x14B8 self-picture Cb component start offset shadow register
    UINT32 mi_sp_cr_base_ad_shd; // Base address shadow register for self picture Cr component ring buffer (r) MRV_MI_BASE + 0x00bc
//    UINT32 mi_sp_cr_base_adr_shd;               // 0x14BC self-picture Cr component ring buffer base address shadow register
    UINT32 mi_sp_cr_size_shd; // Size shadow register of self picture Cr component ring buffer (r) MRV_MI_BASE + 0x00c0
    UINT32 mi_sp_cr_offs_cnt_shd; // Current offset counter of self picture Cr component ring buffer (r) MRV_MI_BASE + 0x00c4
//    UINT32 mi_sp_cr_offs_shd;                   // 0x14C4 self-picture Cr component start offset shadow register

  #if ((MARVIN_FEATURE_MI >= MARVIN_FEATURE_MI_V2) && \
       (MARVIN_FEATURE_MI <= MARVIN_FEATURE_MI_V4))
    UINT32 mi_dma_y_pic_start_ad; // Y component image start address (rw) MRV_MI_BASE + 0x00c8
//    UINT32 mi_dma_y_pic_base_ad;                // 0x14C8 MI Y component image start address register
    UINT32 mi_dma_y_pic_width; // Y component image width (rw) MRV_MI_BASE + 0x00cc
    UINT32 mi_dma_y_llength; // Y component original line length (rw) MRV_MI_BASE + 0x00d0
    UINT32 mi_dma_y_pic_size; // Y component image size (rw) MRV_MI_BASE + 0x00d4
    UINT32 mi_dma_cb_pic_start_ad; // Cb component image start address (rw) MRV_MI_BASE + 0x00d8
//    UINT32 mi_dma_cb_pic_base_ad;               // 0x14D8 MI CB component image start address register

  #if ((MARVIN_FEATURE_MI <= MARVIN_FEATURE_MI_V4) && (MARVIN_FEATURE_MI >= MARVIN_FEATURE_MI_V3))
    UINT32 notused_mi2[(0x14E8-0x14DC)/4];      // memory gap
    #else   // #if (MARVIN_FEATURE_MI == MARVIN_FEATURE_MI_V3)
    UINT32 mi_dma_cb_pic_width;                 // 0x14DC MI CB component image width register
    UINT32 mi_dma_cb_llength;                   // 0x14E0 MI CB component original line length register
    UINT32 mi_dma_cb_pic_size;                  // 0x14E4 MI CB component image size register
    #endif  // #if (MARVIN_FEATURE_MI == MARVIN_FEATURE_MI_V3)

    UINT32 mi_dma_cr_pic_start_ad; // Cr component image start address (rw) MRV_MI_BASE + 0x00e8
//    UINT32 mi_dma_cr_pic_base_ad;               // 0x14E8 MI CR component image start address register

  #if ((MARVIN_FEATURE_MI <= MARVIN_FEATURE_MI_V4) && (MARVIN_FEATURE_MI >= MARVIN_FEATURE_MI_V3))
    UINT32 notused_mi3[(0x14F8-0x14EC)/4];      // memory gap
    #else   // #if (MARVIN_FEATURE_MI == MARVIN_FEATURE_MI_V3)
    UINT32 mi_dma_cr_pic_width;                 // 0x14EC MI CR component image width register
    UINT32 mi_dma_cr_llength;                   // 0x14F0 MI CR component original line length register
    UINT32 mi_dma_cr_pic_size;                  // 0x14F4 MI CR component image size register
    #endif  // #if (MARVIN_FEATURE_MI == MARVIN_FEATURE_MI_V3)

    UINT32 mi_imsc; // Interrupt Mask (‘1’: interrupt active, ‘0’: interrupt masked) (rw) MRV_MI_BASE + 0x00f8
    UINT32 mi_ris; // Raw Interrupt Status (r) MRV_MI_BASE + 0x00fc
    UINT32 mi_mis; // Masked Interrupt Status (r) MRV_MI_BASE + 0x0100
    UINT32 mi_icr; // Interrupt Clear Register (w) MRV_MI_BASE + 0x0104
    UINT32 mi_isr; // Interrupt Set Register (w) MRV_MI_BASE + 0x0108
  #else   // #if (MARVIN_FEATURE_MI >= MI_V2 && <= MI_V3)
    UINT32 mi_imsc;                             // 0x14C8 MI interrupt mask register
    UINT32 mi_ris;                              // 0x14CC MI raw interrupt status
    UINT32 mi_mis;                              // 0x14D0 MI masked interrupt status
    UINT32 mi_icr;                              // 0x14D4 MI interrupt clear register
    UINT32 mi_isr;                              // 0x14D8 MI interrupt set register
    UINT32 notused_mi4[(0x150C-0x14DC)/4];      // memory gap
  #endif  // #if (MARVIN_FEATURE_MI >= MI_V2 && <= MI_V3)

  #if (MARVIN_FEATURE_MI_STATUSFLAGS == MARVIN_FEATURE_EXIST)
    UINT32 mi_status; // MI Status Register (r) MRV_MI_BASE + 0x010c
    UINT32 mi_status_clr; // MI Status Clear Register (w) MRV_MI_BASE + 0x0110
  #else   // MARVIN_FEATURE_MI_STATUSFLAGS
    UINT32 notused_mi5[(0x1514-0x150C)/4];      // memory gap
  #endif  // MARVIN_FEATURE_MI_STATUSFLAGS

  #if ((MARVIN_FEATURE_MI <= MARVIN_FEATURE_MI_V4) && (MARVIN_FEATURE_MI >= MARVIN_FEATURE_MI_V3))
    UINT32 mi_sp_y_pic_width; // Y component image width (rw) MRV_MI_BASE + 0x0114
    UINT32 mi_sp_y_pic_height; // Y component image height (rw) MRV_MI_BASE + 0x0118
    UINT32 mi_sp_y_pic_size; // Y component image size (rw) MRV_MI_BASE + 0x011c
